// alert("Привет мир! ");

// Введение в программирование. Первые шаги
// Императивное программирование
// Декларативное
// Процедурное
// Функциональное
// ООП -Объектно-ориентированное программирование

/* 
многострочный
 */
// однострочный

/*
() [] {} ^^ || && %% __ -- ** ++ // \\ '' "" `` ~~ ;; :: ,, .. <> == != 
*/

console.log("Проверка выдачи");

/* let t = document.querySelector("p");
console.log(t);
t.style.color = "blue"; */

let deli;
deli = 10;
let b = 5;
let c = a + b;
console.log(c);
//https://ru.wikipedia.org/wiki/%D0%9C%D0%B5%D1%82%D0%BE%D0%B4_%D1%83%D1%82%D1%91%D0%BD%D0%BA%D0%B0

let d1, d2, d3, d4;

d1 = "первое мая";
d2 = "второе мая";

// строготипизированные, слаботипизированные.
// си - подобные языки, псевдокод
// java - подобные ->> котлин
// javascript ->> dart, typoscript

let bb = 50;
bb = "Добро пожаловать на нашем сайте!"
