// console.log(2 ** 64 - 1);
console.log(Math.pow(2, 64) - 1);
//
// console.log(2 ** 2);
// console.log(2 ** 3);
// console.log(2 ** 4);
// console.log(2 ** 5);
// console.log(2 ** 6);
// console.log(2 ** 7);
// console.log(2 ** 8);

/*
2 в 64 степени = 18 446 744 073 709 551 616
То есть: 18 квинтиллионов 446 квадриллионов 744 триллиона 073 миллиарда 709 миллионов 551 тысяча 616
(2^64 - 1) ответ про зёрна на шахматной доске
 */

// 2**53-1

// 18_446_744_073_709_552_000 -> Js
// 18_446_744_073_709_551_616 -> Математика
//      9_007_199_254_740_991

console.log(Number.MAX_SAFE_INTEGER)

// Какой ответ правильный
// И как дальше жить.

// 1. ЧУвствую подвох. не могу понять в чём. Матемачтически (2^64 - 1)
// 2. консультация
// 3. 2**53-1
let myLovelyOutput = 2**64;

// console.log(2 ** 2);
// console.log(2 ** 3);
// console.log(2 ** 4);
// console.log(2 ** 5);
// console.log(2 ** 6);
// console.log(2 ** 7);
// console.log(2 ** 8);

console.log(2**32)
/* Юнит тестирование*/

// если мы запустим возведение в степень с 2**2, то я ожидаю 4
// 2**64











